Public Attributes | List of all members
API_MiscPlotterInfo Struct Reference
Project Operations
Miscellaneous information of the selected plotter. More...
#include <APIdefs_Environment.h>
 Public Attributes
char  | name [API_DrvNameLen]
Name of the selected plotter.
char  | model [API_DrvNameLen]
Model of the selected plotter.
Detailed Description
Miscellaneous information of the selected plotter.
Remarks
This structure contains name and model of selected plotter in Archicad. Call the ACAPI_ProjectOperation_GetMiscPlotterInfo function to get this data.
Member Data Documentation
◆ model
 API_MiscPlotterInfo::model
Model of the selected plotter.
◆ name
 API_MiscPlotterInfo::name
Name of the selected plotter.